In [2]:
import sys
from pathlib import Path

parent = str(Path().resolve().parent)
if parent not in sys.path:
    sys.path.insert(0, parent)

In [3]:
import pandas as pd
import re

from functions.loading_articles import get_music_articles

In [4]:
with open("../categories/categories_musicians.txt", "r") as file:
    categories_musicians = file.read().splitlines()

with open("../categories/categories_groups.txt", "r") as file:
    categories_groups = file.read().splitlines()

In [5]:
musicians = get_music_articles(categories_musicians)
music_groups = get_music_articles(categories_groups)

In [6]:
print(len(music_groups))
print(len(musicians))

1035
3089

In [7]:
df_groups = pd.DataFrame(music_groups)
df_groups = df_groups.drop(columns=["ns"])

df_musicians = pd.DataFrame(musicians)
df_musicians = df_musicians.drop(columns=["ns"])

# extra col for musicians
def remove_parentheses(name):
    return re.sub(r'\s*\(.*?\)', '', name).strip()

df_musicians["name"] = df_musicians["title"].apply(remove_parentheses)


#df_musicians.to_csv("data/musicians.csv", index=False)
#df_groups.to_csv("data/music_groups.csv", index=False)

In [8]:
df_groups

      pageid                           title
0     489818              A Friend in London
1     157530                            Ache
2     255559                      ADS (band)
3     976777                        Agathorn
4     493993            Alabama Black Snakes
...      ...                             ...
1030   37360          Odense Symfoniorkester
1031  162784       Sjællands Symfoniorkester
1032   10733  Sønderjyllands Symfoniorkester
1033  369172         Aalborg Symfoniorkester
1034  373862          Aarhus Symfoniorkester

[1035 rows x 2 columns]

In [9]:
df_musicians

       pageid                           title                            name
0      178188                Peter Abrahamsen                Peter Abrahamsen
1      200453               Troels Abrahamsen               Troels Abrahamsen
2       85905                        Al Agami                        Al Agami
3      233947                      Kuku Agami                      Kuku Agami
4     1034198                      Alma Agger                      Alma Agger
...       ...                             ...                             ...
3084   930913                 Niklas Walentin                 Niklas Walentin
3085   407771  Frederik Thorkildsen Wexschall  Frederik Thorkildsen Wexschall
3086    86190                    Finn Ziegler                    Finn Ziegler
3087   106266                 Nikolaj Znaider                 Nikolaj Znaider
3088   835364               Christina Åstrand               Christina Åstrand

[3089 rows x 3 columns]